subribe/CELSYNIQ/ESP32S3_Termostat.ino
/*
  ESP32-S3 Room Thermostat ULTRA PRO

  Hardware:
  - ESP32-S3 N16R8 Dev Module
  - ST7789 1.9" IPS TFT 170x320 SPI display
  - SHT41 temperature/humidity sensor on I2C
  - DS3231 RTC on I2C
  - HW-040 rotary encoder with push button
  - 1-channel 5 V relay module, HIGH-level trigger
  - Optional Wi-Fi reset jumper/button: GPIO7 -> GND, internal pull-up

  Required Arduino libraries:
  - Adafruit GFX Library
  - Adafruit ST7735 and ST7789 Library
  - Adafruit SHT4x Library
  - RTClib
  - PubSubClient

  Board: ESP32S3 Dev Module
  Flash: 16MB
  PSRAM: OPI PSRAM
  USB CDC On Boot: Enabled
*/

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include <Wire.h>
#include <SPI.h>
#include <time.h>
#include <math.h>

#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <Adafruit_SHT4x.h>
#include <RTClib.h>
#include <PubSubClient.h>

#include <Fonts/FreeSans9pt7b.h>
#include <Fonts/FreeSansBold12pt7b.h>
#include <Fonts/FreeSansBold18pt7b.h>
#include <Fonts/FreeSansBold24pt7b.h>

#include <esp_task_wdt.h>
#include <driver/gpio.h>
#if __has_include(<esp_arduino_version.h>)
  #include <esp_arduino_version.h>
#endif

#ifndef M_PI
  #define M_PI 3.14159265358979323846
#endif

// ----------------------------- PINOUT ---------------------------------
// I2C bus: SHT41 and DS3231 in parallel.
static const uint8_t PIN_I2C_SDA = 8;
static const uint8_t PIN_I2C_SCL = 9;

// TFT ST7789, 170x320. Display labels often say SCL/SDA, but this is SPI SCK/MOSI.
static const uint8_t PIN_TFT_CS   = 10;
static const uint8_t PIN_TFT_MOSI = 11;  // display SDA / DIN / MOSI
static const uint8_t PIN_TFT_SCLK = 12;  // display SCL / CLK / SCK
static const uint8_t PIN_TFT_DC   = 13;
static const uint8_t PIN_TFT_RST  = 14;
static const uint8_t PIN_TFT_BL   = 21;  // backlight; driven constantly HIGH to avoid PWM shimmer
static const uint32_t TFT_BL_PWM_FREQ = 25000;  // kept only for compatibility with older config fields
static const uint8_t TFT_BL_PWM_RES = 8;
static const uint8_t TFT_BL_PWM_CH = 0;

// Relay. For the shown module ordered as 5V high-level trigger.
// VCC = 5V, GND common, IN = GPIO16. Heating contact: COM + NO.
static const uint8_t PIN_RELAY = 16;
static const bool RELAY_ACTIVE_HIGH = true;

// Rotary encoder HW-040.
static const uint8_t PIN_ENC_CLK = 4;
static const uint8_t PIN_ENC_DT  = 5;
static const uint8_t PIN_ENC_SW  = 6;

// Wi-Fi reset jumper/button: short GPIO7 to GND for at least 4 seconds.
// Do not use GPIO0 here, because GPIO0 is the ESP32 boot/flash strap.
static const uint8_t PIN_WIFI_RESET = 7;

// -------------------------- BASIC SETTINGS -----------------------------
static const uint32_t SERIAL_BAUD = 115200;
static const uint32_t WIFI_CONNECT_TIMEOUT_MS = 12000;
static const uint32_t MQTT_RECONNECT_INTERVAL_MS = 5000;
static const uint16_t MQTT_SOCKET_TIMEOUT_SEC = 4;
static const uint16_t MQTT_KEEPALIVE_SEC = 30;
static const uint32_t SENSOR_INTERVAL_MS = 2000;
static const uint32_t CONTROL_INTERVAL_MS = 300;
static const uint32_t MQTT_PUBLISH_INTERVAL_MS = 10000;
static const uint32_t NTP_SYNC_INTERVAL_MS = 6UL * 60UL * 60UL * 1000UL;
static const uint32_t BUTTON_LONG_PRESS_MS = 5000;
static const uint32_t WIFI_RESET_HOLD_MS = 4000;
static const uint32_t UI_FRAME_MS = 35;       // faster UI response for encoder; still stable on ST7789
static const uint32_t WDT_TIMEOUT_MS = 8000;
static const uint8_t MAX_SCHEDULE = 24;

static const float MIN_SETPOINT = 5.0f;
static const float MAX_SETPOINT = 35.0f;
static const float SETPOINT_STEP = 0.5f;
static const float DEFAULT_SETPOINT = 21.0f;
static const float DEFAULT_HYSTERESIS = 1.0f;

// Europe/Warsaw with DST.
static const char *DEFAULT_TZ = "CET-1CEST,M3.5.0/2,M10.5.0/3";
static const char *FW_VERSION = "2026.07.11-premium-r1";
static const char *HA_DISCOVERY_PREFIX = "homeassistant";

// Landscape after rotation(1): 320 x 170.
static const int TFT_W = 320;
static const int TFT_H = 170;

// Many 1.9" ST7789 IPS modules need display inversion ON.
// Symptoms when wrong: black becomes white and orange flame looks blue.
static const bool TFT_COLOR_INVERT = true;

// ------------------------------ OBJECTS --------------------------------
Adafruit_ST7789 tft = Adafruit_ST7789(&SPI, PIN_TFT_CS, PIN_TFT_DC, PIN_TFT_RST);
GFXcanvas16 *fb = nullptr;  // pseudo framebuffer: draw to RAM, then push one complete frame
Adafruit_SHT4x sht4;
RTC_DS3231 rtc;
Preferences prefs;
WebServer server(80);
WiFiClient wifiClient;
PubSubClient mqtt(wifiClient);

TaskHandle_t uiTaskHandle = nullptr;
TaskHandle_t logicTaskHandle = nullptr;

// ------------------------------- TYPES ---------------------------------
enum RunMode : uint8_t {
  MODE_AUTO = 0,
  MODE_MANUAL = 1,
  MODE_OFF = 2
};

enum RelayOverride : uint8_t {
  OVR_NONE = 0,
  OVR_FORCE_ON = 1,
  OVR_FORCE_OFF = 2
};

enum ScreenMode : uint8_t {
  SCREEN_MAIN = 0,
  SCREEN_SETTINGS = 1
};

struct ScheduleEntry {
  bool enabled = false;
  uint16_t startMin = 0;
  uint16_t endMin = 0;
  float setpoint = DEFAULT_SETPOINT;
  float hysteresis = DEFAULT_HYSTERESIS;
};

struct DeviceConfig {
  String deviceName;
  String wifiSsid;
  String wifiPass;

  String mqttHost;
  uint16_t mqttPort = 1883;
  String mqttUser;
  String mqttPass;
  String mqttPrefix;
  bool mqttDiscovery = true;

  bool ntpEnabled = true;
  String tzString;

  uint8_t lcdBrightness = 80;  // percent
  float manualHysteresis = DEFAULT_HYSTERESIS;
};

struct RuntimeState {
  bool sensorOk = false;
  bool rtcOk = false;
  bool wifiOk = false;
  bool apActive = false;
  bool mqttOk = false;

  float temperature = NAN;
  float humidity = NAN;
  float target = DEFAULT_SETPOINT;
  float activeHysteresis = DEFAULT_HYSTERESIS;
  float manualSetpoint = DEFAULT_SETPOINT;

  RunMode mode = MODE_AUTO;
  RelayOverride relayOverride = OVR_NONE;
  bool relayOn = false;

  uint32_t heatingCyclesToday = 0;
  uint32_t currentDayOrdinal = 0;

  ScreenMode screen = SCREEN_MAIN;
  int settingsPage = 0;
};

struct UiSnapshot {
  bool sensorOk;
  bool rtcOk;
  bool wifiOk;
  bool apActive;
  bool mqttOk;
  float temperature;
  float humidity;
  float target;
  float activeHysteresis;
  float manualSetpoint;
  RunMode mode;
  RelayOverride relayOverride;
  bool relayOn;
  uint32_t heatingCyclesToday;
  ScreenMode screen;
  int settingsPage;
  uint8_t lcdBrightness;
  String ip;
  String ssid;
  String timeShort;
  String dateShort;
};

struct Palette {
  uint16_t bgTop;
  uint16_t bgBottom;
  uint16_t panel;
  uint16_t text;
  uint16_t muted;
  uint16_t accent;
  uint16_t accent2;
  uint16_t danger;
  uint16_t ringDim;
};

DeviceConfig config;
RuntimeState state;
ScheduleEntry scheduleEntries[MAX_SCHEDULE];
uint8_t scheduleCount = 0;
String scheduleRaw;

uint32_t lastSensorMs = 0;
uint32_t lastControlMs = 0;
uint32_t lastMqttPublishMs = 0;
uint32_t lastMqttReconnectMs = 0;
uint32_t lastNtpSyncMs = 0;
bool wifiReconnectRequested = false;
bool mdnsStarted = false;
String mqttLastError = "MQTT nie uruchomione";
uint32_t mqttLastAttemptMs = 0;
bool pendingManualSetpointSave = false;
uint32_t lastManualSetpointChangeMs = 0;

// Encoder ISR state.
static const int8_t DRAM_ATTR ENC_TABLE[16] = {0, -1, 1, 0, 1, 0, 0, -1, -1, 0, 0, 1, 0, 1, -1, 0};
portMUX_TYPE encMux = portMUX_INITIALIZER_UNLOCKED;
volatile int32_t encDelta = 0;
volatile int8_t encAcc = 0;
volatile uint8_t encLastState = 0;

