subribe/CELSYNIQ/ESP32S3_Termostat.ino
// Button and reset jumper state.
bool btnLastRaw = false;
bool btnStable = false;
uint32_t btnDebounceMs = 0;
uint32_t btnPressStartMs = 0;
bool btnLongHandled = false;
uint32_t wifiResetStartMs = 0;
bool wifiResetHandled = false;

// UI animation state lives only on UI task/core.
float uiTemp = NAN;
float uiTarget = DEFAULT_SETPOINT;
float uiHum = NAN;
float uiPhase = 0.0f;

// --------------------------- SMALL HELPERS ------------------------------
String twoDigits(int v) {
  if (v < 10) return String("0") + String(v);
  return String(v);
}

String macSuffix() {
  uint64_t mac = ESP.getEfuseMac();
  char b[7];
  snprintf(b, sizeof(b), "%06X", (uint32_t)(mac & 0xFFFFFF));
  return String(b);
}

String sanitizeTopicPart(String s) {
  s.trim();
  s.toLowerCase();
  String out;
  for (uint16_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if ((c >= 'a' && c <= 'z') || (c >= '0' && c <= '9') || c == '_' || c == '-') out += c;
    else if (c == ' ' || c == '.') out += '_';
  }
  if (out.length() == 0) out = "thermostat";
  return out;
}

String htmlEscape(const String &s) {
  String out;
  out.reserve(s.length() + 16);
  for (uint16_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if (c == '&') out += F("&amp;");
    else if (c == '<') out += F("&lt;");
    else if (c == '>') out += F("&gt;");
    else if (c == '"') out += F("&quot;");
    else out += c;
  }
  return out;
}

String jsonEscape(const String &s) {
  String out;
  out.reserve(s.length() + 8);
  for (uint16_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if (c == '\\') out += F("\\\\");
    else if (c == '"') out += F("\\\"");
    else if (c == '\n') out += F("\\n");
    else if (c == '\r') out += F("\\r");
    else if (c == '\t') out += F("\\t");
    else out += c;
  }
  return out;
}

float clampFloat(float value, float mn, float mx) {
  if (value < mn) return mn;
  if (value > mx) return mx;
  return value;
}

uint8_t clampBrightness(int value) {
  if (value < 0) return 0;
  if (value > 100) return 100;
  return (uint8_t)value;
}

String modeToText(RunMode mode) {
  switch (mode) {
    case MODE_AUTO: return "auto";
    case MODE_MANUAL: return "manual";
    case MODE_OFF: return "off";
  }
  return "auto";
}

String modeToDisplayText(RunMode mode) {
  switch (mode) {
    case MODE_AUTO: return "AUTO";
    case MODE_MANUAL: return "RECZNY";
    case MODE_OFF: return "OFF";
  }
  return "AUTO";
}

String modeToHaClimateText(RunMode mode) {
  switch (mode) {
    case MODE_AUTO: return "auto";
    case MODE_MANUAL: return "heat";
    case MODE_OFF: return "off";
  }
  return "auto";
}

String overrideToText(RelayOverride ovr) {
  switch (ovr) {
    case OVR_NONE: return "auto";
    case OVR_FORCE_ON: return "force_on";
    case OVR_FORCE_OFF: return "force_off";
  }
  return "auto";
}

uint16_t rgb565(uint8_t r, uint8_t g, uint8_t b) {
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

uint8_t r565(uint16_t c) { return ((c >> 11) & 0x1F) * 255 / 31; }
uint8_t g565(uint16_t c) { return ((c >> 5) & 0x3F) * 255 / 63; }
uint8_t b565(uint16_t c) { return (c & 0x1F) * 255 / 31; }

uint16_t mix565(uint16_t a, uint16_t b, float t) {
  if (t < 0) t = 0;
  if (t > 1) t = 1;
  uint8_t r = (uint8_t)(r565(a) + (r565(b) - r565(a)) * t);
  uint8_t g = (uint8_t)(g565(a) + (g565(b) - g565(a)) * t);
  uint8_t bl = (uint8_t)(b565(a) + (b565(b) - b565(a)) * t);
  return rgb565(r, g, bl);
}

uint16_t scale565(uint16_t c, uint8_t percent) {
  // Software LCD brightness. Backlight stays constant HIGH to avoid PWM shimmer,
  // but the UI palette is scaled so the WebGUI brightness control has visible effect.
  percent = clampBrightness(percent);
  float k = percent / 100.0f;
  uint8_t r = (uint8_t)(r565(c) * k);
  uint8_t g = (uint8_t)(g565(c) * k);
  uint8_t b = (uint8_t)(b565(c) * k);
  return rgb565(r, g, b);
}

Palette paletteFor(const UiSnapshot &s) {
  Palette p;
  // Pure black base: no bright background, no animated bands, no gradients.
  p.bgTop = ST77XX_BLACK;
  p.bgBottom = ST77XX_BLACK;
  p.panel = rgb565(13, 16, 22);
  p.text = rgb565(246, 248, 252);
  p.muted = rgb565(232, 236, 244);  // very light gray: readable on the menu pages
  p.danger = rgb565(255, 91, 91);
  p.ringDim = rgb565(35, 40, 48);

  if (s.mode == MODE_OFF) {
    p.accent = rgb565(140, 148, 160);
    p.accent2 = rgb565(75, 82, 94);
  } else if (s.relayOn) {
    p.accent = rgb565(255, 142, 50);   // warm orange for heating
    p.accent2 = rgb565(255, 72, 72);
  } else if (s.mode == MODE_MANUAL) {
    p.accent = rgb565(160, 118, 255);
    p.accent2 = rgb565(72, 210, 255);
  } else {
    p.accent = rgb565(35, 224, 200);
    p.accent2 = rgb565(64, 145, 255);
  }

  // No hardware PWM on BL pin: it caused visible shimmer on this LCD.
  // Brightness from WebGUI now dims the rendered palette instead.
  uint8_t b = s.lcdBrightness;
  uint8_t b20 = (b < 20) ? 20 : b;
  uint8_t b28 = (b < 45) ? 45 : b;
  p.panel = scale565(p.panel, b20);
  p.text = scale565(p.text, b28);
  p.muted = scale565(p.muted, b28);
  p.danger = scale565(p.danger, b28);
  p.ringDim = scale565(p.ringDim, b20);
  p.accent = scale565(p.accent, b28);
  p.accent2 = scale565(p.accent2, b28);
  return p;
}

void setupBacklightPwm() {
  // W ESP32 Core 3.0+ używamy nowej funkcji ledcAttach:
  // Składnia: ledcAttach(PIN, CZĘSTOTLIWOŚĆ, ROZDZIELCZOŚĆ);
  // Zwraca automatycznie przypisany kanał, ale nie musimy go znać do sterowania pinem.
  ledcAttach(PIN_TFT_BL, TFT_BL_PWM_FREQ, TFT_BL_PWM_RES);
  
  // Ustawienie początkowej jasności przy starcie
  uint32_t duty = (clampBrightness(config.lcdBrightness) * 255) / 100;
  ledcWrite(PIN_TFT_BL, duty);
}

void setBacklight(uint8_t percent) {
  percent = clampBrightness(percent);
  
  // Zabezpieczenie przed programowym migotaniem
  if (config.lcdBrightness == percent) {
    return; 
  }
  
  config.lcdBrightness = percent;
  
  // Przeliczenie procentów na wartość 8-bit (0-255)
  uint32_t duty = (percent * 255) / 100;
  
  // W nowym API ledcWrite przyjmuje bezpośrednio NUMER PINU, a nie numer kanału!
  ledcWrite(PIN_TFT_BL, duty);
}

void setRelayPhysical(bool on) {
  digitalWrite(PIN_RELAY, (on == RELAY_ACTIVE_HIGH) ? HIGH : LOW);
}

// ----------------------------- WATCHDOG ---------------------------------
void initWatchdog() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t cfg = {};
  cfg.timeout_ms = WDT_TIMEOUT_MS;
  cfg.idle_core_mask = 0;
  cfg.trigger_panic = true;
  esp_task_wdt_init(&cfg);
#else
  esp_task_wdt_init(WDT_TIMEOUT_MS / 1000, true);
#endif
}

void wdtAddCurrentTask() {
  esp_task_wdt_add(NULL);
}

