subribe/CELSYNIQ/ESP32S3_Termostat.ino
void wdtFeed() {
  esp_task_wdt_reset();
}

// ---------------------------- PREFERENCES -------------------------------
String defaultScheduleText() {
  return String(
    "00:00-06:00,19,1\n"
    "06:00-08:00,21,1\n"
    "08:00-16:00,19,1\n"
    "16:00-22:30,21,1\n"
    "22:30-00:00,19,1\n"
  );
}

void loadConfig() {
  prefs.begin("thermostat", false);

  String defaultName = "termostat_" + macSuffix();
  config.deviceName = prefs.getString("devName", defaultName);
  config.wifiSsid = prefs.getString("wifiSsid", "");
  config.wifiPass = prefs.getString("wifiPass", "");

  config.mqttHost = prefs.getString("mqttHost", "");
  config.mqttHost.trim();
  config.mqttPort = prefs.getUShort("mqttPort", 1883);
  config.mqttUser = prefs.getString("mqttUser", "");
  config.mqttPass = prefs.getString("mqttPass", "");
  config.mqttPrefix = prefs.getString("mqttPrefix", "home/thermostat");
  config.mqttPrefix.trim();
  if (config.mqttPrefix.length() == 0) config.mqttPrefix = "home/thermostat";
  config.mqttDiscovery = prefs.getBool("mqttDisc", true);

  config.ntpEnabled = prefs.getBool("ntp", true);
  config.tzString = prefs.getString("tz", DEFAULT_TZ);
  config.lcdBrightness = prefs.getUChar("bright", 80);
  config.manualHysteresis = prefs.getFloat("manHyst", DEFAULT_HYSTERESIS);
  state.manualSetpoint = prefs.getFloat("lastSet", DEFAULT_SETPOINT);
  state.manualSetpoint = clampFloat(state.manualSetpoint, MIN_SETPOINT, MAX_SETPOINT);

  scheduleRaw = prefs.getString("schedule", defaultScheduleText());
}

void saveConfig() {
  prefs.putString("devName", config.deviceName);
  prefs.putString("wifiSsid", config.wifiSsid);
  prefs.putString("wifiPass", config.wifiPass);
  prefs.putString("mqttHost", config.mqttHost);
  prefs.putUShort("mqttPort", config.mqttPort);
  prefs.putString("mqttUser", config.mqttUser);
  prefs.putString("mqttPass", config.mqttPass);
  prefs.putString("mqttPrefix", config.mqttPrefix);
  prefs.putBool("mqttDisc", config.mqttDiscovery);
  prefs.putBool("ntp", config.ntpEnabled);
  prefs.putString("tz", config.tzString);
  prefs.putUChar("bright", config.lcdBrightness);
  prefs.putFloat("manHyst", config.manualHysteresis);
  prefs.putFloat("lastSet", state.manualSetpoint);
}

void saveScheduleRaw(const String &raw) {
  scheduleRaw = raw;
  prefs.putString("schedule", scheduleRaw);
}

void clearWifiCredentials() {
  config.wifiSsid = "";
  config.wifiPass = "";
  prefs.putString("wifiSsid", "");
  prefs.putString("wifiPass", "");
}

// ----------------------------- SCHEDULE ---------------------------------
bool parseTimeToMinutes(String token, uint16_t &minutes) {
  token.trim();
  token.replace('.', ':');
  int colon = token.indexOf(':');
  int h = 0;
  int m = 0;

  if (colon >= 0) {
    h = token.substring(0, colon).toInt();
    m = token.substring(colon + 1).toInt();
  } else {
    h = token.toInt();
    m = 0;
  }

  if (h == 24 && m == 0) {
    minutes = 0;  // 24:00 as midnight; range crossing midnight handles it.
    return true;
  }
  if (h < 0 || h > 23 || m < 0 || m > 59) return false;
  minutes = (uint16_t)(h * 60 + m);
  return true;
}

bool lineToScheduleEntry(String line, ScheduleEntry &entry) {
  line.trim();
  if (line.length() == 0) return false;
  if (line.startsWith("#")) return false;

  int dash = line.indexOf('-');
  int comma1 = line.indexOf(',', dash + 1);
  int comma2 = line.indexOf(',', comma1 + 1);
  if (dash < 0 || comma1 < 0 || comma2 < 0) return false;

  String startStr = line.substring(0, dash);
  String endStr = line.substring(dash + 1, comma1);
  String tempStr = line.substring(comma1 + 1, comma2);
  String hystStr = line.substring(comma2 + 1);
  tempStr.trim();
  hystStr.trim();

  uint16_t startMin = 0;
  uint16_t endMin = 0;
  if (!parseTimeToMinutes(startStr, startMin)) return false;
  if (!parseTimeToMinutes(endStr, endMin)) return false;

  float temp = tempStr.toFloat();
  float hyst = hystStr.toFloat();
  if (temp < MIN_SETPOINT || temp > MAX_SETPOINT) return false;
  if (hyst < 0.1f || hyst > 5.0f) return false;

  entry.enabled = true;
  entry.startMin = startMin;
  entry.endMin = endMin;
  entry.setpoint = temp;
  entry.hysteresis = hyst;
  return true;
}

void parseScheduleText(const String &raw) {
  scheduleCount = 0;
  String copy = raw;
  copy.replace("\r", "");

  uint16_t pos = 0;
  while (pos < copy.length() && scheduleCount < MAX_SCHEDULE) {
    int nl = copy.indexOf('\n', pos);
    String line;
    if (nl < 0) {
      line = copy.substring(pos);
      pos = copy.length();
    } else {
      line = copy.substring(pos, nl);
      pos = nl + 1;
    }

    ScheduleEntry e;
    if (lineToScheduleEntry(line, e)) {
      scheduleEntries[scheduleCount++] = e;
    }
  }

  if (scheduleCount == 0) {
    ScheduleEntry fallback;
    fallback.enabled = true;
    fallback.startMin = 0;
    fallback.endMin = 0;
    fallback.setpoint = DEFAULT_SETPOINT;
    fallback.hysteresis = DEFAULT_HYSTERESIS;
    scheduleEntries[0] = fallback;
    scheduleCount = 1;
  }
}

bool minuteInRange(uint16_t nowMin, uint16_t startMin, uint16_t endMin) {
  if (startMin == endMin) return true;  // full day
  if (startMin < endMin) return nowMin >= startMin && nowMin < endMin;
  return nowMin >= startMin || nowMin < endMin;  // crosses midnight
}

ScheduleEntry currentScheduleEntry(uint16_t nowMin) {
  for (uint8_t i = 0; i < scheduleCount; i++) {
    if (scheduleEntries[i].enabled && minuteInRange(nowMin, scheduleEntries[i].startMin, scheduleEntries[i].endMin)) {
      return scheduleEntries[i];
    }
  }
  ScheduleEntry fallback;
  fallback.enabled = true;
  fallback.setpoint = DEFAULT_SETPOINT;
  fallback.hysteresis = DEFAULT_HYSTERESIS;
  return fallback;
}

// ------------------------------ TIME ------------------------------------
DateTime nowDateTime() {
  if (state.rtcOk) return rtc.now();

  time_t raw = time(nullptr);
  struct tm t;
  if (raw > 1600000000 && localtime_r(&raw, &t)) {
    return DateTime(t.tm_year + 1900, t.tm_mon + 1, t.tm_mday, t.tm_hour, t.tm_min, t.tm_sec);
  }
  return DateTime(2025, 1, 1, 0, 0, 0);
}

String dateTimeToString(const DateTime &dt) {
  return String(dt.year()) + "-" + twoDigits(dt.month()) + "-" + twoDigits(dt.day()) + " " +
         twoDigits(dt.hour()) + ":" + twoDigits(dt.minute()) + ":" + twoDigits(dt.second());
}

bool parseDateTimeString(String s, DateTime &out) {
  s.trim();
  if (s.length() < 16) return false;
  s.replace('T', ' ');
  int year = s.substring(0, 4).toInt();
  int mon = s.substring(5, 7).toInt();
  int day = s.substring(8, 10).toInt();
  int hour = s.substring(11, 13).toInt();
  int minute = s.substring(14, 16).toInt();
  int second = 0;
  if (s.length() >= 19) second = s.substring(17, 19).toInt();
  if (year < 2024 || mon < 1 || mon > 12 || day < 1 || day > 31 || hour > 23 || minute > 59 || second > 59) return false;
  out = DateTime(year, mon, day, hour, minute, second);
  return true;
}

