subribe/CELSYNIQ/ESP32S3_Termostat.ino
void initRtc() {
  state.rtcOk = rtc.begin();
  if (!state.rtcOk) {
    Serial.println(F("RTC DS3231 not found."));
    return;
  }
  if (rtc.lostPower()) {
    Serial.println(F("RTC lost power; setting to compile time."));
    rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
  }
}

void syncRtcFromNtp(bool force) {
  if (!config.ntpEnabled) return;
  if (!state.wifiOk) return;
  if (!force && millis() - lastNtpSyncMs < NTP_SYNC_INTERVAL_MS) return;

  configTzTime(config.tzString.c_str(), "pool.ntp.org", "time.google.com", "time.cloudflare.com");
  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 7000)) {
    if (state.rtcOk) {
      rtc.adjust(DateTime(timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday,
                          timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec));
    }
    lastNtpSyncMs = millis();
    Serial.println(F("NTP sync OK."));
  } else {
    Serial.println(F("NTP sync failed."));
  }
}

// ------------------------------ SENSORS ---------------------------------
void initSensors() {
  state.sensorOk = sht4.begin();
  if (state.sensorOk) {
    sht4.setPrecision(SHT4X_HIGH_PRECISION);
    sht4.setHeater(SHT4X_NO_HEATER);
    Serial.println(F("SHT4x OK."));
  } else {
    Serial.println(F("SHT4x not found."));
  }
}

void readSensors() {
  if (!state.sensorOk) {
    state.sensorOk = sht4.begin();
    if (!state.sensorOk) return;
  }

  sensors_event_t humidityEvent;
  sensors_event_t tempEvent;
  if (sht4.getEvent(&humidityEvent, &tempEvent)) {
    state.temperature = tempEvent.temperature;
    state.humidity = humidityEvent.relative_humidity;
  } else {
    state.sensorOk = false;
    state.temperature = NAN;
    state.humidity = NAN;
  }
}

// ------------------------------- CONTROL --------------------------------
void updateDailyCounter(const DateTime &now) {
  uint32_t day = now.unixtime() / 86400UL;
  if (state.currentDayOrdinal == 0) state.currentDayOrdinal = day;
  if (day != state.currentDayOrdinal) {
    state.currentDayOrdinal = day;
    state.heatingCyclesToday = 0;
  }
}

void calculateTarget() {
  DateTime now = nowDateTime();
  updateDailyCounter(now);

  if (state.mode == MODE_AUTO) {
    uint16_t nowMin = (uint16_t)(now.hour() * 60 + now.minute());
    ScheduleEntry e = currentScheduleEntry(nowMin);
    state.target = e.setpoint;
    state.activeHysteresis = e.hysteresis;
  } else {
    state.target = state.manualSetpoint;
    state.activeHysteresis = config.manualHysteresis;
  }
}

void updateRelayControl() {
  calculateTarget();

  bool desired = false;

  if (state.relayOverride == OVR_FORCE_ON) {
    desired = true;
  } else if (state.relayOverride == OVR_FORCE_OFF) {
    desired = false;
  } else if (state.mode == MODE_OFF) {
    desired = false;
  } else if (state.sensorOk && !isnan(state.temperature)) {
    // Heating hysteresis: ON at target - hysteresis, OFF at target.
    if (state.relayOn) desired = state.temperature < state.target;
    else desired = state.temperature <= (state.target - state.activeHysteresis);
  }

  if (desired != state.relayOn) {
    if (!state.relayOn && desired) state.heatingCyclesToday++;
    state.relayOn = desired;
    setRelayPhysical(state.relayOn);
    lastMqttPublishMs = 0;  // publish immediately on state change
  }
}

String climateActionText() {
  if (state.mode == MODE_OFF) return "off";
  if (state.relayOn) return "heating";
  return "idle";
}

// ------------------------------- DISPLAY --------------------------------
void initDisplay() {
  pinMode(PIN_TFT_BL, OUTPUT);
  setupBacklightPwm();
  setBacklight(config.lcdBrightness);

  SPI.begin(PIN_TFT_SCLK, -1, PIN_TFT_MOSI, PIN_TFT_CS);
  tft.init(170, 320);
  tft.setRotation(3); // rotacja ekranu 1 lub 3 
  tft.invertDisplay(TFT_COLOR_INVERT);
  tft.setSPISpeed(40000000);
  tft.fillScreen(ST77XX_BLACK);
  delay(50);
  tft.fillScreen(ST77XX_BLACK);
  tft.setTextWrap(false);

  fb = new GFXcanvas16(TFT_W, TFT_H);
  if (!fb || !fb->getBuffer()) {
    Serial.println(F("FATAL: framebuffer allocation failed."));
    tft.setCursor(0, 0);
    tft.setTextColor(ST77XX_RED, ST77XX_BLACK);
    tft.print("Framebuffer ERR");
    while (true) delay(1000);
  }
}

void drawGradient(GFXcanvas16 &c, const Palette &p) {
  // Hard black background. This removes the visible panel-wide colour bands.
  c.fillScreen(ST77XX_BLACK);
}

void drawSoftPanel(GFXcanvas16 &c, int x, int y, int w, int h, uint16_t color) {
  c.fillRoundRect(x, y, w, h, 14, color);
  c.drawRoundRect(x, y, w, h, 14, mix565(color, rgb565(255, 255, 255), 0.11f));
}

void drawCenteredText(GFXcanvas16 &c, const String &txt, const GFXfont *font, uint16_t color, int baselineY) {
  c.setFont(font);
  c.setTextSize(1);
  c.setTextColor(color);
  int16_t x1, y1;
  uint16_t w, h;
  c.getTextBounds(txt, 0, baselineY, &x1, &y1, &w, &h);
  int x = (TFT_W - (int)w) / 2 - x1;
  c.setCursor(x, baselineY);
  c.print(txt);
}

void drawPill(GFXcanvas16 &c, int x, int y, int w, int h, const String &txt, uint16_t bg, uint16_t fg) {
  c.fillRoundRect(x, y, w, h, h / 2, bg);
  c.drawRoundRect(x, y, w, h, h / 2, mix565(bg, fg, 0.22f));
  c.setFont(NULL);
  c.setTextSize(1);
  c.setTextColor(fg);
  int tx = x + 8;
  int ty = y + (h - 8) / 2;
  c.setCursor(tx, ty);
  c.print(txt);
}

void drawStatusLabel(GFXcanvas16 &c, int x, int y, const char *label, bool ok, uint16_t okColor, uint16_t offColor) {
  uint16_t col = ok ? okColor : offColor;
  c.setFont(NULL);
  c.setTextSize(1);
  c.setTextColor(col);
  c.setCursor(x, y);
  c.print(label);
  c.fillCircle(x + strlen(label) * 6 + 6, y + 4, 3, col);
}

void drawHandIcon(GFXcanvas16 &c, int x, int y, uint16_t color) {
  // Small custom manual-mode hand glyph. Avoids emoji/font problems on GFX fonts.
  c.fillRoundRect(x + 6, y + 7, 13, 12, 4, color);      // palm
  c.fillRoundRect(x + 3, y + 10, 7, 5, 3, color);       // thumb
  c.fillRoundRect(x + 6, y + 0, 4, 10, 2, color);       // fingers
  c.fillRoundRect(x + 11, y + 1, 4, 10, 2, color);
  c.fillRoundRect(x + 16, y + 3, 4, 9, 2, color);
  c.fillRoundRect(x + 21, y + 6, 4, 8, 2, color);
  c.drawRoundRect(x + 1, y + 0, 25, 20, 6, mix565(color, ST77XX_WHITE, 0.35f));
}

