subribe/CELSYNIQ/ESP32S3_Termostat.ino
void drawDegreeC(GFXcanvas16 &c, int x, int y, uint16_t color) {
  // Separate compact degree/C mark. Large gap prevents overlap with big digits.
  c.drawCircle(x, y - 19, 4, color);
  c.setFont(&FreeSansBold12pt7b);
  c.setTextSize(1);
  c.setTextColor(color);
  c.setCursor(x + 12, y - 2);
  c.print("C");
}

void drawFlameIcon(GFXcanvas16 &c, int x, int y, uint16_t hot, uint16_t core) {
  // Original orange heating glyph made from primitives. No emoji fonts needed.
  uint16_t rim = rgb565(255, 86, 18);
  uint16_t body = rgb565(255, 143, 31);
  uint16_t inner = rgb565(255, 218, 93);
  c.fillCircle(x, y + 22, 13, rim);
  c.fillTriangle(x - 14, y + 23, x + 14, y + 23, x - 1, y + 1, rim);
  c.fillTriangle(x - 5, y + 16, x + 12, y + 24, x + 5, y - 2, body);
  c.fillCircle(x, y + 23, 8, body);
  c.fillCircle(x, y + 25, 5, inner);
  c.fillTriangle(x - 5, y + 24, x + 5, y + 24, x, y + 11, inner);
}

void drawMetricTile(GFXcanvas16 &c, int x, int y, int w, int h, const char *label, const String &value, uint16_t labelColor, uint16_t valueColor, uint16_t borderColor) {
  uint16_t bg = rgb565(10, 13, 18);
  c.fillRoundRect(x, y, w, h, 12, bg);
  c.drawRoundRect(x, y, w, h, 12, mix565(borderColor, rgb565(255, 255, 255), 0.05f));
  c.setFont(NULL);
  c.setTextSize(1);
  c.setTextColor(labelColor);
  c.setCursor(x + 10, y + 7);
  c.print(label);
  c.setTextSize(2);
  c.setTextColor(valueColor);
  c.setCursor(x + 10, y + 20);
  c.print(value);
}

void drawHeatFlowRing(GFXcanvas16 &c, const Palette &p, bool heating, float phase) {
  int cx = 160;
  int cy = 78;
  int r = 63;

  for (int i = 0; i < 5; i++) {
    uint16_t col = mix565(p.ringDim, p.accent, 0.10f + i * 0.08f);
    c.drawCircle(cx, cy, r - i * 4, col);
  }

  int dots = heating ? 14 : 8;
  for (int i = 0; i < dots; i++) {
    float a = phase + (float)i * (2.0f * M_PI / dots);
    float breath = 0.5f + 0.5f * sinf(phase * 1.4f + i * 0.8f);
    int rr = r - 3 - (i % 3);
    int x = cx + (int)(cosf(a) * rr);
    int y = cy + (int)(sinf(a) * rr);
    uint16_t col = mix565(p.accent2, p.accent, breath);
    int rad = heating ? 3 + (i % 2) : 2;
    c.fillCircle(x, y, rad, col);
  }
}

UiSnapshot makeSnapshot() {
  UiSnapshot s;
  s.sensorOk = state.sensorOk;
  s.rtcOk = state.rtcOk;
  s.wifiOk = state.wifiOk;
  s.apActive = state.apActive;
  s.mqttOk = state.mqttOk;
  s.temperature = state.temperature;
  s.humidity = state.humidity;
  s.target = (state.mode == MODE_MANUAL) ? state.manualSetpoint : state.target;
  s.activeHysteresis = state.activeHysteresis;
  s.manualSetpoint = state.manualSetpoint;
  s.mode = state.mode;
  s.relayOverride = state.relayOverride;
  s.relayOn = state.relayOn;
  s.heatingCyclesToday = state.heatingCyclesToday;
  s.screen = state.screen;
  s.settingsPage = state.settingsPage;
  s.lcdBrightness = config.lcdBrightness;
  s.ip = state.wifiOk ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  s.ssid = state.wifiOk ? WiFi.SSID() : String("AP: Termostat-") + macSuffix();
  DateTime now = nowDateTime();
  s.timeShort = twoDigits(now.hour()) + ":" + twoDigits(now.minute());
  s.dateShort = String(now.year()) + "-" + twoDigits(now.month()) + "-" + twoDigits(now.day());
  return s;
}

void renderMain(GFXcanvas16 &c, const UiSnapshot &s) {
  // -------------------------------------------------------------------------
  // 1. OBSŁUGA CAŁKOWITEGO WYŁĄCZENIA (0%)
  // -------------------------------------------------------------------------
  if (s.lcdBrightness == 0) {
    c.fillScreen(rgb565(0, 0, 0)); // Czyszczenie ekranu na czarno
    return; // Przerywamy dalsze rysowanie – brak napisów, brak ikon
  }

  // 2. LOGIKA CZUJNIKÓW I PASMA
  if (s.sensorOk && !isnan(s.temperature)) {
    if (isnan(uiTemp)) uiTemp = s.temperature;
    uiTemp += (s.temperature - uiTemp) * 0.22f;
  }
  if (s.sensorOk && !isnan(s.humidity)) {
    if (isnan(uiHum)) uiHum = s.humidity;
    uiHum += (s.humidity - uiHum) * 0.16f;
  }
  uiTarget = s.target;

  Palette p = paletteFor(s);
  drawGradient(c, p);

  // Liniowe skalowanie dla ikon i kolorów w pełnym zakresie 1-100%
  // map(wartość, od_min, od_max, do_min, do_max)
  uint8_t colorDimFactor = map(s.lcdBrightness, 1, 100, 20, 255);

  // 3. GÓRNY PASEK STANU
  const uint16_t statusOn = rgb565(0, 255, 72);
  const uint16_t statusOff = rgb565(128, 136, 148);
  drawStatusLabel(c, 12, 11, "WiFi", s.wifiOk, statusOn, statusOff);
  drawStatusLabel(c, 64, 11, "HA", s.mqttOk, statusOn, statusOff);
  
  if (s.mode == MODE_MANUAL) {
    // Liniowe ściemnianie ikony trybu manualnego
    uint16_t handColor = scale565(rgb565(255, 204, 92), colorDimFactor);
    drawHandIcon(c, 112, 5, handColor);
  } else if (s.mode == MODE_OFF) {
    drawPill(c, 112, 6, 38, 16, "OFF", mix565(p.panel, p.danger, 0.42f), p.text);
  }

  c.setFont(NULL);
  c.setTextSize(1);
  c.setTextColor(p.muted);
  c.setCursor(270, 11);
  c.print(s.timeShort);

  // Liniowe ściemnianie ikony płomienia
  if (s.relayOn) {
    uint16_t flame1 = scale565(rgb565(255, 143, 31), colorDimFactor);
    uint16_t flame2 = scale565(rgb565(255, 218, 93), colorDimFactor);
    drawFlameIcon(c, 291, 36, flame1, flame2);
  }

  // -------------------------------------------------------------------------
  // 4. GŁÓWNY BLOK TEMPERATURY Z LINIOWĄ KOREKTĄ
  // -------------------------------------------------------------------------
  String tempTxt = (s.sensorOk && !isnan(uiTemp)) ? String(uiTemp, 1) : String("--.-");
  uint16_t tempColor = p.text;
  
  if (s.sensorOk && !isnan(s.temperature)) {
    const float band = max(0.0f, s.activeHysteresis);
    
    if (s.temperature > (s.target + band + 0.05f)) {
      // Liniowe ściemnianie czerwieni od 1% do 100% jasności
      tempColor = scale565(rgb565(255, 82, 82), colorDimFactor);
    } 
    else if (s.temperature < (s.target - band - 0.05f)) {
      // Liniowe ściemnianie niebieskiego od 1% do 100% jasności
      tempColor = scale565(rgb565(74, 164, 255), colorDimFactor);
    } 
    else {
      // Biały tekst ściemnia się dobrze naturalnie za sprawą PWM podświetlenia
      tempColor = p.text;
    }
  }

  c.setFont(&FreeSansBold24pt7b);
  c.setTextSize(2);
  c.setTextColor(tempColor);
  int16_t x1, y1;
  uint16_t w, h;
  c.getTextBounds(tempTxt, 0, 0, &x1, &y1, &w, &h);
  int totalW = (int)w + 42;
  int tempX = (TFT_W - totalW) / 2 - x1;
  if (tempX < 4) tempX = 4;
  int tempBase = 103;
  c.setCursor(tempX, tempBase);
  c.print(tempTxt);

  // Znak stopnia i jednostka "C"
  int degX = tempX + (int)w + 13;
  c.drawCircle(degX, tempBase - 67, 5, tempColor);
  c.setFont(&FreeSansBold12pt7b);
  c.setTextSize(1);
  c.setTextColor(tempColor);
  c.setCursor(degX + 14, tempBase - 51);
  c.print("C");

  // -------------------------------------------------------------------------
  // 5. DOLNA SEKCJA / KAFLIKI
  // -------------------------------------------------------------------------
  if (s.mode == MODE_OFF) {
    drawMetricTile(c, 89, 116, 142, 40, "", "OFF", p.text, p.text, p.panel);
    return;
  }

  String humTxt = (s.sensorOk && !isnan(uiHum)) ? String(uiHum, 0) + "%" : "--%";
  String targetTxt = String(uiTarget, 1) + " C";

