subribe/CELSYNIQ/ESP32S3_Termostat.ino
  drawMetricTile(c, 14, 114, 142, 42, "WILGOTNOSC", humTxt, p.text, p.text, p.panel);
  drawMetricTile(c, 164, 114, 142, 42, "CEL", targetTxt, p.muted, p.text, p.panel);

  if (s.relayOverride != OVR_NONE) {
    drawPill(c, 204, 146, 102, 18, s.relayOverride == OVR_FORCE_ON ? "PRZEK. ON" : "PRZEK. OFF", mix565(p.panel, p.danger, 0.35f), p.text);
  }
}

void renderSettings(GFXcanvas16 &c, const UiSnapshot &s) {
  Palette p = paletteFor(s);

  // Full canvas redraw only. Do not call tft.fillScreen() from the menu renderer,
  // because physical clearing on every frame causes visible blinking on this ST7789.
  drawGradient(c, p);
  uint16_t panelBg = mix565(p.panel, p.bgTop, 0.18f);
  drawSoftPanel(c, 8, 8, 304, 154, panelBg);

  // No large "MENU" label: on this panel it was leaving a visible edge glyph,
  // seen as a single letter on the WiFi status page.
  c.setFont(NULL);
  c.setTextSize(1);
  c.setTextColor(mix565(p.muted, p.text, 0.65f));
  c.setCursor(252, 18);
  c.print("str ");
  c.print(s.settingsPage + 1);
  c.print("/4");

  c.drawFastHLine(18, 36, 284, mix565(p.ringDim, p.accent, 0.45f));

  // Brighter menu text. These pages are informational, so contrast is more important
  // than decorative grey.
  const uint16_t menuText = p.text;
  const uint16_t menuMuted = mix565(p.muted, p.text, 0.55f);
  c.setFont(NULL);
  c.setTextSize(2);
  c.setTextColor(menuText);

  if (s.settingsPage == 0) {
    c.setCursor(22, 52); c.print("WiFi: "); c.print(s.wifiOk ? "POLACZONE" : (s.apActive ? "Haslo:12345678" : "BRAK"));
    c.setCursor(22, 78); c.print("SSID: "); c.print(s.ssid.substring(0, 19));
    c.setCursor(22, 104); c.print("IP: "); c.print(s.ip);
    c.setCursor(22, 130); c.print("RTC: "); c.print(s.rtcOk ? "OK" : "BRAK");
  } else if (s.settingsPage == 1) {
    c.setCursor(22, 52); c.print("AUTO temp.: "); c.print(String(s.target, 1));
    c.drawCircle(212, 52, 2, menuText);
    c.setCursor(22, 80); c.print("AUTO hist.: "); c.print(String(s.activeHysteresis, 1));
    c.drawCircle(212, 80, 2, menuText);
    c.setCursor(22, 108); c.print("Manual: "); c.print(String(s.manualSetpoint, 1));
    c.drawCircle(165, 108, 2, menuText);
  } else if (s.settingsPage == 2) {
    c.setCursor(22, 52); c.print("Cykle dzis: "); c.print(s.heatingCyclesToday);
    c.setCursor(22, 80); c.print("Przekaznik: "); c.print(s.relayOn ? "ON" : "OFF");
    c.setCursor(22, 108); c.print("Wymuszenie: "); c.print(overrideToText(s.relayOverride));
  } else {
    c.setCursor(22, 52); c.print("Czas: "); c.print(s.timeShort);
    c.setCursor(22, 80); c.print("Data: "); c.print(s.dateShort);
    c.setCursor(22, 108); c.print("Jasnosc LCD: "); c.print(s.lcdBrightness); c.print("%");
    // Reset WiFi information is intentionally hidden from the device screen.
  }

  // Soft footer hint, bright enough to read but not dominant.
  c.setTextSize(1);
  c.setTextColor(menuMuted);
  c.setCursor(22, 148);
  c.print("obrot: strona   klik: wyjscie");

  c.drawRoundRect(8, 8, 304, 154, 14, mix565(panelBg, rgb565(255, 255, 255), 0.13f));
}

void renderFrame() {
  if (!fb) return;
  static ScreenMode lastScreen = SCREEN_MAIN;
  static bool firstFrame = true;
  UiSnapshot s = makeSnapshot();
  uiPhase += s.relayOn ? 0.12f : 0.035f;
  if (uiPhase > 2.0f * M_PI) uiPhase -= 2.0f * M_PI;

  if (firstFrame || s.screen != lastScreen) {
    // One-time physical clear removes possible residual glyphs in the ST7789 edge area.
    tft.fillScreen(ST77XX_BLACK);
    lastScreen = s.screen;
    firstFrame = false;
  }

  if (s.screen == SCREEN_MAIN) renderMain(*fb, s);
  else renderSettings(*fb, s);

  tft.drawRGBBitmap(0, 0, fb->getBuffer(), TFT_W, TFT_H);
}

void ensureMdnsStarted();

// ------------------------------ WIFI ------------------------------------
void startAccessPoint() {
  String apName = "Termostat-" + macSuffix();
  WiFi.mode(WIFI_AP_STA);
  bool ok = WiFi.softAP(apName.c_str(), "12345678");
  state.apActive = ok;
  Serial.print(F("AP: "));
  Serial.print(apName);
  Serial.print(F("  IP: "));
  Serial.println(WiFi.softAPIP());
}

void connectWiFiBlocking() {
  if (config.wifiSsid.length() == 0) {
    WiFi.mode(WIFI_AP_STA);
    startAccessPoint();
    state.wifiOk = false;
    return;
  }

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(config.wifiSsid.c_str(), config.wifiPass.c_str());

  Serial.print(F("Connecting WiFi"));
  uint32_t started = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - started < WIFI_CONNECT_TIMEOUT_MS) {
    delay(250);
    Serial.print('.');
  }
  Serial.println();

  state.wifiOk = (WiFi.status() == WL_CONNECTED);
  if (state.wifiOk) {
    state.apActive = false;
    Serial.print(F("WiFi OK, IP: "));
    Serial.println(WiFi.localIP());
    ensureMdnsStarted();
    MDNS.addService("http", "tcp", 80);
  } else {
    Serial.println(F("WiFi failed; starting configuration AP."));
    startAccessPoint();
  }
}

void reconnectWiFiNow() {
  Serial.println(F("WiFi reconnect requested."));
  mqtt.disconnect();
  WiFi.disconnect(true, true);
  mdnsStarted = false;
  delay(250);
  state.wifiOk = false;
  state.apActive = false;
  connectWiFiBlocking();
  if (state.wifiOk) syncRtcFromNtp(true);
}

void updateWiFiState() {
  bool was = state.wifiOk;
  state.wifiOk = (WiFi.status() == WL_CONNECTED);
  if (was != state.wifiOk) lastMqttPublishMs = 0;
}

void handleWifiResetPin() {
  bool low = (digitalRead(PIN_WIFI_RESET) == LOW);
  if (!low) {
    wifiResetStartMs = 0;
    wifiResetHandled = false;
    return;
  }

  if (wifiResetStartMs == 0) wifiResetStartMs = millis();
  if (!wifiResetHandled && millis() - wifiResetStartMs >= WIFI_RESET_HOLD_MS) {
    wifiResetHandled = true;
    clearWifiCredentials();
    saveConfig();
    wifiReconnectRequested = true;
    Serial.println(F("WiFi credentials cleared by GPIO7 reset pin."));
  }
}

// ------------------------------ WEB UI ----------------------------------
String stateJson() {
  DateTime now = nowDateTime();
  String json = "{";
  json += "\"time\":\"" + dateTimeToString(now) + "\",";

  json += "\"temperature\":";
  if (state.sensorOk && !isnan(state.temperature)) json += String(state.temperature, 2); else json += "null";
  json += ",\"humidity\":";
  if (state.sensorOk && !isnan(state.humidity)) json += String(state.humidity, 2); else json += "null";

  json += ",\"target\":"; json += String(state.target, 2);
  json += ",\"hysteresis\":"; json += String(state.activeHysteresis, 2);
  json += ",\"manualSetpoint\":"; json += String(state.manualSetpoint, 2);
  json += ",\"manualHysteresis\":"; json += String(config.manualHysteresis, 2);
  json += ",\"mode\":\"" + modeToText(state.mode) + "\"";
  json += ",\"relay\":"; json += (state.relayOn ? "true" : "false");
  json += ",\"relayOverride\":\"" + overrideToText(state.relayOverride) + "\"";
  json += ",\"cyclesToday\":"; json += String(state.heatingCyclesToday);
  json += ",\"wifi\":"; json += (state.wifiOk ? "true" : "false");
  json += ",\"ap\":"; json += (state.apActive ? "true" : "false");
  json += ",\"ip\":\"" + (state.wifiOk ? WiFi.localIP().toString() : WiFi.softAPIP().toString()) + "\"";
  json += ",\"ssid\":\"" + jsonEscape(state.wifiOk ? WiFi.SSID() : String("Termostat-") + macSuffix()) + "\"";
  json += ",\"rssi\":"; json += String(state.wifiOk ? WiFi.RSSI() : 0);
  json += ",\"mqtt\":"; json += (state.mqttOk ? "true" : "false");
  json += ",\"mqttError\":\"" + jsonEscape(mqttLastError) + "\"";
  json += ",\"rtc\":"; json += (state.rtcOk ? "true" : "false");
  json += ",\"brightness\":"; json += String(config.lcdBrightness);
  json += "}";
  return json;
}

String configJson() {
  String json = "{";
  json += "\"devName\":\"" + jsonEscape(config.deviceName) + "\",";
  json += "\"wifiSsid\":\"" + jsonEscape(config.wifiSsid) + "\",";
  json += "\"mqttHost\":\"" + jsonEscape(config.mqttHost) + "\",";
  json += "\"mqttPort\":" + String(config.mqttPort) + ",";
  json += "\"mqttUser\":\"" + jsonEscape(config.mqttUser) + "\",";
  json += "\"mqttPrefix\":\"" + jsonEscape(config.mqttPrefix) + "\",";
  json += "\"mqttDiscovery\":"; json += (config.mqttDiscovery ? "true" : "false");
  json += ",\"ntp\":"; json += (config.ntpEnabled ? "true" : "false");
  json += ",\"tz\":\"" + jsonEscape(config.tzString) + "\",";
  json += "\"brightness\":" + String(config.lcdBrightness) + ",";
  json += "\"manualHysteresis\":" + String(config.manualHysteresis, 2) + ",";
  json += "\"schedule\":\"" + jsonEscape(scheduleRaw) + "\"";
  json += "}";
  return json;
}

const char INDEX_HTML[] PROGMEM = R"rawliteral(
<!doctype html><html lang="pl"><head><meta charset="utf-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>Panel</title>
<style>
:root{--bg:#05070d;--panel:#111722;--panel2:#18202d;--text:#f4f7fb;--muted:#8e9aac;--a:#23e0c8;--b:#ff8b3a;--d:#ff5b5b;--ok:#37d67a}*{box-sizing:border-box}body{margin:0;background:radial-gradient(circle at 30% 0%,#102a35 0%,#05070d 38%,#020309 100%);color:var(--text);font-family:system-ui,-apple-system,Segoe UI,Roboto,Arial,sans-serif}main{max-width:980px;margin:0 auto;padding:16px}.grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(150px,1fr));gap:12px}.card{background:rgba(17,23,34,.86);border:1px solid rgba(255,255,255,.08);border-radius:22px;padding:16px;margin:12px 0;box-shadow:0 12px 35px rgba(0,0,0,.25);backdrop-filter:blur(10px)}.tile{background:linear-gradient(180deg,rgba(255,255,255,.06),rgba(255,255,255,.02));border:1px solid rgba(255,255,255,.07);border-radius:18px;padding:14px}.label{color:var(--muted);font-size:13px}.value{font-size:30px;font-weight:800;margin-top:4px}.row{display:grid;grid-template-columns:210px 1fr;gap:12px;align-items:center;margin:10px 0}input,textarea,select{width:100%;border:1px solid rgba(255,255,255,.12);border-radius:12px;background:#090d15;color:var(--text);padding:10px;font:inherit}textarea{min-height:150px;font-family:ui-monospace,Consolas,monospace}button{border:0;border-radius:14px;background:linear-gradient(135deg,var(--a),#358bff);color:#001214;font-weight:800;padding:11px 14px;margin:5px;cursor:pointer}.heat{background:linear-gradient(135deg,var(--b),#ff3d4e);color:#1b0600}.danger{background:linear-gradient(135deg,#ff5b5b,#ff294d);color:white}.ghost{background:#202a3a;color:var(--text)}.ok{color:var(--ok)}.bad{color:var(--d)}code{color:#c7f7ef}.tabs{display:flex;gap:8px;flex-wrap:wrap;margin:8px 0}.tab{background:#121a27;color:var(--text)}.tab.active{background:var(--text);color:#05070d}@media(max-width:640px){.row{grid-template-columns:1fr}.value{font-size:26px}}
</style></head><body><main>
<section class="card"><div class="grid">
<div class="tile"><div class="label">Aktualna temperatura</div><div class="value" id="temp">--</div></div>
<div class="tile"><div class="label">Wilgotność</div><div class="value" id="hum">--</div></div>
<div class="tile"><div class="label">Żądana temperatura</div><div class="value" id="target">--</div></div>
<div class="tile"><div class="label">Tryb pracy</div><div class="value" id="mode">--</div></div>
<div class="tile"><div class="label">Przekaźnik grzania</div><div class="value" id="relay">--</div></div>
<div class="tile"><div class="label">Cykle grzania dziś</div><div class="value" id="cycles">--</div></div>
</div></section>
<section class="card"><div class="tabs"><button class="tab active" onclick="showTab('control',this)">Sterowanie</button><button class="tab" onclick="showTab('config',this)">Konfiguracja</button><button class="tab" onclick="showTab('service',this)">Serwis</button></div>
<div id="control">
<div class="row"><label>Temperatura ręczna [°C]</label><input id="manualSetpoint" type="number" step="0.5" min="5" max="35"></div>
<button onclick="setManual()">Ustaw tryb RĘCZNY</button><button class="ghost" onclick="setMode('auto')">Tryb AUTO</button><button class="ghost" onclick="setMode('manual')">Tryb RĘCZNY</button><button class="danger" onclick="setMode('off')">Termostat OFF</button><br>
<button class="ghost" onclick="setRelay('AUTO')">Przekaźnik AUTO</button><button class="heat" onclick="setRelay('ON')">Przekaźnik ON</button><button class="danger" onclick="setRelay('OFF')">Przekaźnik OFF</button>
<div class="row"><label>Jasność LCD [%]</label><input id="brightness" type="range" min="0" max="100" oninput="setQuick('brightness',this.value)"></div>
</div>
<div id="config" style="display:none">
<div class="row"><label>Nazwa MQTT/HA</label><input id="devName"></div>
<div class="row"><label>SSID Wi‑Fi</label><input id="wifiSsid"></div>
<div class="row"><label>Hasło Wi‑Fi</label><input id="wifiPass" type="password" placeholder="zostaw puste, jeśli bez zmian"></div>
<div class="row"><label>MQTT host/IP</label><input id="mqttHost"></div>
<div class="row"><label>MQTT port</label><input id="mqttPort" type="number"></div>
<div class="row"><label>MQTT użytkownik</label><input id="mqttUser"></div>
<div class="row"><label>MQTT hasło</label><input id="mqttPass" type="password" placeholder="zostaw puste, jeśli bez zmian"></div>
<div class="row"><label>MQTT prefix</label><input id="mqttPrefix"></div>
<div class="row"><label>Discovery Home Assistant</label><select id="mqttDiscovery"><option value="1">włączone</option><option value="0">wyłączone</option></select></div>
<div class="row"><label>Histereza ręczna [°C]</label><input id="manualHysteresis" type="number" step="0.1" min="0.1" max="5"></div>
<div class="row"><label>NTP</label><select id="ntp"><option value="1">włączone</option><option value="0">wyłączone</option></select></div>
<div class="row"><label>Strefa TZ POSIX</label><input id="tz"></div>
<div class="row"><label>Harmonogram AUTO<br><code>HH:MM-HH:MM,temp,hist</code></label><textarea id="schedule"></textarea></div>
<button onclick="saveConfig()">Zapisz bez restartu</button>
</div>
<div id="service" style="display:none">
<div class="grid"><div class="tile"><div class="label">Wi‑Fi</div><div class="value" id="wifi">--</div></div><div class="tile"><div class="label">MQTT</div><div class="value" id="mqtt">--</div></div><div class="tile"><div class="label">RTC</div><div class="value" id="rtc">--</div></div><div class="tile"><div class="label">IP</div><div class="value" id="ip" style="font-size:20px">--</div></div></div>
<p>Kasowanie zapamiętanego Wi‑Fi sprzętowo: zewrzyj GPIO7 do GND przez minimum 4 sekundy. Pin ma włączone podciąganie programowe.</p>
<div class="row"><label>Ustaw RTC</label><input id="rtcSet" placeholder="YYYY-MM-DD HH:MM:SS"></div><button onclick="setRtc()">Ustaw RTC</button><button onclick="ntpNow()">Synchronizuj NTP teraz</button><br>
<button onclick="haDiscovery()">Wyślij discovery HA</button><button class="danger" onclick="resetWifi()">Skasuj Wi‑Fi i uruchom hotspot</button><button class="ghost" onclick="restartEsp()">Restart ESP</button>
</div></section>
</main><script>
function q(id){return document.getElementById(id)}function f(v,d=1){return v==null?'--':Number(v).toFixed(d)}
function showTab(id,btn){['control','config','service'].forEach(x=>q(x).style.display=x==id?'block':'none');document.querySelectorAll('.tab').forEach(b=>b.classList.remove('active'));btn.classList.add('active')}
async function api(path, data){let opt={method:data?'POST':'GET'};if(data){opt.headers={'Content-Type':'application/x-www-form-urlencoded'};opt.body=new URLSearchParams(data)}let r=await fetch(path,opt);return await r.json().catch(()=>({ok:false}))}
function setIdleValue(id,val){let e=q(id);if(e&&document.activeElement!==e)e.value=val}
async function poll(){try{let s=await api('/api/state');q('temp').textContent=f(s.temperature,1)+' °C';q('hum').textContent=f(s.humidity,0)+' %';q('target').textContent=String(s.mode)=='off'?'OFF':f(s.target,1)+' °C';q('mode').textContent=String(s.mode).toUpperCase();q('relay').textContent=s.relay?'ON':'OFF';q('cycles').textContent=s.cyclesToday;q('wifi').textContent=s.wifi?'OK':(s.ap?'HOTSPOT':'BRAK');q('mqtt').textContent=s.mqtt?'OK':'OFF';q('rtc').textContent=s.rtc?'OK':'BRAK';q('ip').textContent=s.ip;setIdleValue('manualSetpoint',s.manualSetpoint);setIdleValue('brightness',s.brightness);setIdleValue('rtcSet',s.time)}catch(e){}}
async function loadCfg(){let c=await api('/api/config');['devName','wifiSsid','mqttHost','mqttPort','mqttUser','mqttPrefix','manualHysteresis','tz','schedule'].forEach(k=>{if(q(k)&&c[k]!==undefined)q(k).value=c[k]});q('mqttDiscovery').value=c.mqttDiscovery?'1':'0';q('ntp').value=c.ntp?'1':'0'}
async function setManual(){await api('/api/set',{mode:'manual',setpoint:q('manualSetpoint').value});poll()}
async function setMode(m){await api('/api/set',{mode:m});poll()}
async function setRelay(o){await api('/api/set',{relayOverride:o});poll()}
async function setQuick(k,v){let d={};d[k]=v;await api('/api/set',d);poll()}
async function saveConfig(){let d={devName:q('devName').value,wifiSsid:q('wifiSsid').value,wifiPass:q('wifiPass').value,mqttHost:q('mqttHost').value,mqttPort:q('mqttPort').value,mqttUser:q('mqttUser').value,mqttPass:q('mqttPass').value,mqttPrefix:q('mqttPrefix').value,mqttDiscovery:q('mqttDiscovery').value,manualHysteresis:q('manualHysteresis').value,ntp:q('ntp').value,tz:q('tz').value,schedule:q('schedule').value};let r=await api('/api/config',d);alert(r.message||'Zapisano')}
async function setRtc(){await api('/api/rtc',{dt:q('rtcSet').value});poll()}async function ntpNow(){await api('/api/ntp',{});poll()}async function resetWifi(){if(confirm('Skasować Wi‑Fi? Urządzenie uruchomi hotspot konfiguracyjny.'))await api('/api/resetwifi',{})}async function haDiscovery(){let r=await api('/api/ha_discovery',{});alert(r.message||'Discovery wyslane')}async function restartEsp(){if(confirm('Restart ESP?'))await api('/api/restart',{})}
loadCfg();poll();setInterval(poll,1000);
</script></body></html>
)rawliteral";

void handleRoot() {
  server.send_P(200, "text/html; charset=utf-8", INDEX_HTML);
}

void handleApiSet() {
  if (server.hasArg("mode")) {
    String m = server.arg("mode");
    m.toLowerCase();
    if (m == "auto") state.mode = MODE_AUTO;
    else if (m == "manual" || m == "heat") state.mode = MODE_MANUAL;
    else if (m == "off") state.mode = MODE_OFF;
    state.relayOverride = OVR_NONE;
  }
  if (server.hasArg("setpoint")) {
    state.manualSetpoint = clampFloat(server.arg("setpoint").toFloat(), MIN_SETPOINT, MAX_SETPOINT);
    prefs.putFloat("lastSet", state.manualSetpoint);
    state.mode = MODE_MANUAL;
    state.relayOverride = OVR_NONE;
  }
  if (server.hasArg("relayOverride")) {
    String o = server.arg("relayOverride");
    o.toUpperCase();
    if (o == "ON") state.relayOverride = OVR_FORCE_ON;
    else if (o == "OFF") state.relayOverride = OVR_FORCE_OFF;
    else state.relayOverride = OVR_NONE;
  }
  if (server.hasArg("brightness")) {
    setBacklight(clampBrightness(server.arg("brightness").toInt()));
    prefs.putUChar("bright", config.lcdBrightness);
  }
  if (server.hasArg("manualHysteresis")) {
    config.manualHysteresis = clampFloat(server.arg("manualHysteresis").toFloat(), 0.1f, 5.0f);
    prefs.putFloat("manHyst", config.manualHysteresis);
  }
  lastMqttPublishMs = 0;
  server.send(200, "application/json", "{\"ok\":true}");
}

void handleApiConfigSave() {
  bool wifiChanged = false;
  bool mqttChanged = false;

  if (server.hasArg("devName")) {
    String v = server.arg("devName");
    v.trim();
    if (v.length() > 0 && v != config.deviceName) { config.deviceName = v; mqttChanged = true; }
  }
  if (server.hasArg("wifiSsid")) {
    String v = server.arg("wifiSsid");
    if (v != config.wifiSsid) { config.wifiSsid = v; wifiChanged = true; }
  }
  if (server.hasArg("wifiPass")) {
    String v = server.arg("wifiPass");
    if (v.length() > 0 && v != config.wifiPass) { config.wifiPass = v; wifiChanged = true; }
  }
  if (server.hasArg("mqttHost")) { String v = server.arg("mqttHost"); v.trim(); if (v != config.mqttHost) { config.mqttHost = v; mqttChanged = true; } }
  if (server.hasArg("mqttPort")) { uint16_t v = (uint16_t)server.arg("mqttPort").toInt(); if (v == 0) v = 1883; if (v != config.mqttPort) { config.mqttPort = v; mqttChanged = true; } }
  if (server.hasArg("mqttUser")) { String v = server.arg("mqttUser"); v.trim(); if (v != config.mqttUser) { config.mqttUser = v; mqttChanged = true; } }
  if (server.hasArg("mqttPass")) { String v = server.arg("mqttPass"); if (v.length() > 0 && v != config.mqttPass) { config.mqttPass = v; mqttChanged = true; } }
  if (server.hasArg("mqttPrefix")) { String v = server.arg("mqttPrefix"); v.trim(); if (v.length() == 0) v = "home/thermostat"; if (v != config.mqttPrefix) { config.mqttPrefix = v; mqttChanged = true; } }
  if (server.hasArg("mqttDiscovery")) { bool v = server.arg("mqttDiscovery") == "1"; if (v != config.mqttDiscovery) { config.mqttDiscovery = v; mqttChanged = true; } }
  if (server.hasArg("manualHysteresis")) config.manualHysteresis = clampFloat(server.arg("manualHysteresis").toFloat(), 0.1f, 5.0f);
  if (server.hasArg("ntp")) config.ntpEnabled = server.arg("ntp") == "1";
  if (server.hasArg("tz")) config.tzString = server.arg("tz");
  if (server.hasArg("schedule")) {
    saveScheduleRaw(server.arg("schedule"));
    parseScheduleText(scheduleRaw);
  }

