subribe/CELSYNIQ/ESP32S3_Termostat.ino
  saveConfig();
  if (mqttChanged) {
    mqtt.disconnect();
    state.mqttOk = false;
    mqttLastError = "konfiguracja MQTT zmieniona";
    initMqtt();
    lastMqttReconnectMs = 0;
  }
  if (wifiChanged) wifiReconnectRequested = true;

  String msg = wifiChanged ? "Zapisano. Wi-Fi zostanie przełączone bez restartu." : "Zapisano bez restartu.";
  server.send(200, "application/json", String("{\"ok\":true,\"message\":\"") + jsonEscape(msg) + "\"}");
}

void handleApiRtc() {
  if (server.hasArg("dt")) {
    DateTime dt;
    if (parseDateTimeString(server.arg("dt"), dt) && state.rtcOk) {
      rtc.adjust(dt);
      server.send(200, "application/json", "{\"ok\":true}");
      return;
    }
  }
  server.send(400, "application/json", "{\"ok\":false}");
}

void handleApiNtp() {
  syncRtcFromNtp(true);
  server.send(200, "application/json", "{\"ok\":true}");
}

void handleApiResetWifi() {
  clearWifiCredentials();
  saveConfig();
  wifiReconnectRequested = true;
  server.send(200, "application/json", "{\"ok\":true,\"message\":\"WiFi skasowane. Uruchamiam hotspot konfiguracyjny.\"}");
}

void handleApiHaDiscovery() {
  if (mqtt.connected()) {
    publishDiscovery();
    publishMqttState();
    server.send(200, "application/json", "{\"ok\":true,\"message\":\"Discovery Home Assistant wyslane.\"}");
  } else {
    server.send(503, "application/json", String("{\"ok\":false,\"message\":\"") + jsonEscape(mqttLastError) + "\"}");
  }
}

void handleApiRestart() {
  server.send(200, "application/json", "{\"ok\":true}");
  delay(250);
  ESP.restart();
}

void initWebServer() {
  server.on("/", HTTP_GET, handleRoot);
  server.on("/api/state", HTTP_GET, []() { server.send(200, "application/json", stateJson()); });
  server.on("/api/config", HTTP_GET, []() { server.send(200, "application/json", configJson()); });
  server.on("/api/set", HTTP_POST, handleApiSet);
  server.on("/api/config", HTTP_POST, handleApiConfigSave);
  server.on("/api/rtc", HTTP_POST, handleApiRtc);
  server.on("/api/ntp", HTTP_POST, handleApiNtp);
  server.on("/api/resetwifi", HTTP_POST, handleApiResetWifi);
  server.on("/api/ha_discovery", HTTP_POST, handleApiHaDiscovery);
  server.on("/api/restart", HTTP_POST, handleApiRestart);
  server.onNotFound([]() { server.send(404, "application/json", "{\"ok\":false,\"error\":\"404\"}"); });
  server.begin();
}

// ------------------------------- MQTT -----------------------------------
String mqttStateName(int rc) {
  switch (rc) {
    case MQTT_CONNECTION_TIMEOUT: return "timeout - broker nie odpowiada";
    case MQTT_CONNECTION_LOST: return "connection lost";
    case MQTT_CONNECT_FAILED: return "connect failed - port/firewall/adres";
    case MQTT_DISCONNECTED: return "disconnected";
    case MQTT_CONNECTED: return "connected";
    case MQTT_CONNECT_BAD_PROTOCOL: return "bad protocol";
    case MQTT_CONNECT_BAD_CLIENT_ID: return "bad client id";
    case MQTT_CONNECT_UNAVAILABLE: return "broker unavailable";
    case MQTT_CONNECT_BAD_CREDENTIALS: return "bledny login/haslo";
    case MQTT_CONNECT_UNAUTHORIZED: return "unauthorized";
    default: return "rc=" + String(rc);
  }
}

void mqttSetError(const String &msg) {
  mqttLastError = msg;
  Serial.print(F("MQTT: "));
  Serial.println(msg);
}

void ensureMdnsStarted() {
  if (!state.wifiOk || mdnsStarted) return;
  String host = sanitizeTopicPart(config.deviceName);
  if (host.length() < 3) host = "termostat-" + macSuffix();
  if (MDNS.begin(host.c_str())) {
    mdnsStarted = true;
    Serial.print(F("mDNS started as: "));
    Serial.print(host);
    Serial.println(F(".local"));
  } else {
    Serial.println(F("mDNS start failed; normal DNS/IP MQTT will still work."));
  }
}

bool resolveMqttHost(IPAddress &ipOut) {
  String host = config.mqttHost;
  host.trim();
  if (host.length() == 0) {
    mqttSetError(F("brak MQTT host/IP w konfiguracji"));
    return false;
  }

  String lower = host;
  lower.toLowerCase();
  if (lower == "localhost" || lower == "127.0.0.1" || lower == "0.0.0.0") {
    mqttSetError(F("MQTT host nie moze byc localhost/127.0.0.1; wpisz IP brokera w sieci LAN"));
    return false;
  }

  if (ipOut.fromString(host)) return true;

  if (lower.endsWith(".local")) {
    ensureMdnsStarted();
    String mdnsName = host.substring(0, host.length() - 6);
    IPAddress mdnsIp = MDNS.queryHost(mdnsName.c_str(), 2500);
    if (mdnsIp != IPAddress(0, 0, 0, 0)) {
      ipOut = mdnsIp;
      return true;
    }
    Serial.print(F("MQTT mDNS resolve failed for "));
    Serial.println(host);
  }

  if (WiFi.hostByName(host.c_str(), ipOut) == 1 && ipOut != IPAddress(0, 0, 0, 0)) return true;

  mqttSetError(String(F("nie moge rozwiazac MQTT host: ")) + host);
  return false;
}

String mqttBase() {
  // Stable topic root. Do not derive MQTT topics from editable display name,
  // otherwise Home Assistant can keep stale retained discovery topics after rename.
  return config.mqttPrefix + "/esp32s3_thermostat_" + macSuffix();
}

String deviceId() {
  return "esp32s3_thermostat_" + macSuffix();
}

bool mqttPublish(const String &topic, const String &payload, bool retained = true) {
  if (!mqtt.connected()) return false;
  bool ok = mqtt.publish(topic.c_str(), payload.c_str(), retained);
  if (!ok) {
    Serial.print(F("MQTT publish FAILED topic="));
    Serial.print(topic);
    Serial.print(F(" bytes="));
    Serial.println(payload.length());
  }
  return ok;
}

String mqttDeviceJson() {
  String dev = "{\"identifiers\":[\"" + deviceId() + "\"],";
  dev += "\"connections\":[[\"mac\",\"" + WiFi.macAddress() + "\"]],";
  dev += "\"name\":\"" + jsonEscape(config.deviceName) + "\",";
  dev += "\"manufacturer\":\"Margo-Tom DIY\",";
  dev += "\"model\":\"ESP32-S3 Room Thermostat\",";
  dev += "\"hw_version\":\"ESP32-S3 N16R8 + ST7789 + SHT41 + DS3231\",";
  dev += "\"sw_version\":\"" + String(FW_VERSION) + "\"";
  if (state.wifiOk) dev += ",\"configuration_url\":\"http://" + WiFi.localIP().toString() + "/\"";
  dev += "}";
  return dev;
}

String mqttOriginJson() {
  String o = "{\"name\":\"ESP32S3 Thermostat Firmware\",";
  o += "\"sw\":\"" + String(FW_VERSION) + "\",";
  o += "\"url\":\"http://" + (state.wifiOk ? WiFi.localIP().toString() : WiFi.softAPIP().toString()) + "/\"}";
  return o;
}

