subribe/CELSYNIQ/ESP32S3_Termostat.ino
String discoveryTopic(const String &component, const String &objectId) {
  return String(HA_DISCOVERY_PREFIX) + "/" + component + "/" + objectId + "/config";
}

void appendAvailabilityJson(String &payload) {
  payload += "\"availability_topic\":\"" + mqttBase() + "/availability\",";
  payload += "\"payload_available\":\"online\",";
  payload += "\"payload_not_available\":\"offline\",";
}

void publishSensorDiscovery(const String &object, const String &name, const String &topic,
                            const String &deviceClass, const String &unit, const String &stateClass) {
  String id = deviceId() + "_" + object;
  String cfgTopic = discoveryTopic("sensor", id);
  String payload = "{";
  payload += "\"name\":\"" + name + "\",";
  payload += "\"unique_id\":\"" + id + "\",";
  payload += "\"state_topic\":\"" + topic + "\",";
  appendAvailabilityJson(payload);
  payload += "\"origin\":" + mqttOriginJson() + ",";
  if (deviceClass.length()) payload += "\"device_class\":\"" + deviceClass + "\",";
  if (unit.length()) payload += "\"unit_of_measurement\":\"" + unit + "\",";
  if (stateClass.length()) payload += "\"state_class\":\"" + stateClass + "\",";
  if (object == "temperature") payload += "\"suggested_display_precision\":1,";
  if (object == "humidity") payload += "\"suggested_display_precision\":0,";
  payload += "\"device\":" + mqttDeviceJson();
  payload += "}";
  mqttPublish(cfgTopic, payload, true);
}

void publishBinaryDiscovery(const String &object, const String &name, const String &topic) {
  String id = deviceId() + "_" + object;
  String cfgTopic = discoveryTopic("binary_sensor", id);
  String payload = "{";
  payload += "\"name\":\"" + name + "\",";
  payload += "\"unique_id\":\"" + id + "\",";
  payload += "\"state_topic\":\"" + topic + "\",";
  payload += "\"payload_on\":\"ON\",\"payload_off\":\"OFF\",";
  appendAvailabilityJson(payload);
  payload += "\"origin\":" + mqttOriginJson() + ",";
  payload += "\"device\":" + mqttDeviceJson();
  payload += "}";
  mqttPublish(cfgTopic, payload, true);
}

void publishNumberDiscovery(const String &object, const String &name, const String &stateTopic,
                            const String &cmdTopic, float mn, float mx, float step, const String &unit) {
  String id = deviceId() + "_" + object;
  String cfgTopic = discoveryTopic("number", id);
  String payload = "{";
  payload += "\"name\":\"" + name + "\",";
  payload += "\"unique_id\":\"" + id + "\",";
  payload += "\"state_topic\":\"" + stateTopic + "\",";
  payload += "\"command_topic\":\"" + cmdTopic + "\",";
  payload += "\"min\":" + String(mn, 1) + ",\"max\":" + String(mx, 1) + ",\"step\":" + String(step, 1) + ",";
  if (unit.length()) payload += "\"unit_of_measurement\":\"" + unit + "\",";
  payload += "\"mode\":\"slider\",";
  appendAvailabilityJson(payload);
  payload += "\"origin\":" + mqttOriginJson() + ",";
  payload += "\"device\":" + mqttDeviceJson();
  payload += "}";
  mqttPublish(cfgTopic, payload, true);
}

void publishSwitchDiscovery(const String &object, const String &name, const String &stateTopic, const String &cmdTopic,
                            const String &payloadOn, const String &payloadOff, const String &stateOn, const String &stateOff) {
  String id = deviceId() + "_" + object;
  String cfgTopic = discoveryTopic("switch", id);
  String payload = "{";
  payload += "\"name\":\"" + name + "\",";
  payload += "\"unique_id\":\"" + id + "\",";
  payload += "\"state_topic\":\"" + stateTopic + "\",";
  payload += "\"command_topic\":\"" + cmdTopic + "\",";
  payload += "\"payload_on\":\"" + payloadOn + "\",\"payload_off\":\"" + payloadOff + "\",";
  payload += "\"state_on\":\"" + stateOn + "\",\"state_off\":\"" + stateOff + "\",";
  appendAvailabilityJson(payload);
  payload += "\"origin\":" + mqttOriginJson() + ",";
  payload += "\"device\":" + mqttDeviceJson();
  payload += "}";
  mqttPublish(cfgTopic, payload, true);
}

void publishButtonDiscovery(const String &object, const String &name, const String &cmdTopic, const String &payloadPress) {
  String id = deviceId() + "_" + object;
  String cfgTopic = discoveryTopic("button", id);
  String payload = "{";
  payload += "\"name\":\"" + name + "\",";
  payload += "\"unique_id\":\"" + id + "\",";
  payload += "\"command_topic\":\"" + cmdTopic + "\",";
  payload += "\"payload_press\":\"" + payloadPress + "\",";
  appendAvailabilityJson(payload);
  payload += "\"origin\":" + mqttOriginJson() + ",";
  payload += "\"device\":" + mqttDeviceJson();
  payload += "}";
  mqttPublish(cfgTopic, payload, true);
}

void clearLegacyDiscoveryTopics(const String &id) {
  // Older firmware revisions used this climate config topic with the same unique_id.
  // Clearing it avoids duplicated/invalid retained discovery payloads in Home Assistant.
  mqttPublish(String(HA_DISCOVERY_PREFIX) + "/climate/" + id + "/config", "", true);
}

void publishDiscovery() {
  if (!config.mqttDiscovery || !mqtt.connected()) return;

  String base = mqttBase();
  String id = deviceId();

  clearLegacyDiscoveryTopics(id);

  String climateTopic = discoveryTopic("climate", id + "_climate");
  String climate = "{";
  climate += "\"name\":null,";
  climate += "\"object_id\":\"" + id + "_climate\",";
  climate += "\"unique_id\":\"" + id + "_climate\",";
  appendAvailabilityJson(climate);
  climate += "\"current_temperature_topic\":\"" + base + "/temperature/state\",";
  climate += "\"current_humidity_topic\":\"" + base + "/humidity/state\",";
  climate += "\"temperature_state_topic\":\"" + base + "/setpoint/state\",";
  climate += "\"temperature_command_topic\":\"" + base + "/setpoint/set\",";
  climate += "\"mode_state_topic\":\"" + base + "/mode/state\",";
  climate += "\"mode_command_topic\":\"" + base + "/mode/set\",";
  climate += "\"action_topic\":\"" + base + "/action/state\",";
  climate += "\"modes\":[\"off\",\"heat\",\"auto\"],";
  climate += "\"temperature_unit\":\"C\",\"min_temp\":5,\"max_temp\":35,\"temp_step\":0.5,\"precision\":0.1,";
  climate += "\"optimistic\":false,";
  climate += "\"origin\":" + mqttOriginJson() + ",";
  climate += "\"device\":" + mqttDeviceJson();
  climate += "}";
  mqttPublish(climateTopic, climate, true);

