subribe/CELSYNIQ/ESP32S3_Termostat.ino
  publishSensorDiscovery("temperature", "Temperatura", base + "/temperature/state", "temperature", "°C", "measurement");
  publishSensorDiscovery("humidity", "Wilgotnosc", base + "/humidity/state", "humidity", "%", "measurement");
  publishSensorDiscovery("wifi_rssi", "WiFi RSSI", base + "/wifi_rssi/state", "signal_strength", "dBm", "measurement");
  publishSensorDiscovery("cycles_today", "Cykle grzania dzisiaj", base + "/cycles_today/state", "", "", "measurement");
  publishBinaryDiscovery("relay", "Przekaznik grzania ON/OFF", base + "/relay/state");
  publishNumberDiscovery("manual_hysteresis", "Histereza reczna", base + "/hysteresis/state", base + "/hysteresis/set", 0.1f, 5.0f, 0.1f, "°C");
  publishNumberDiscovery("lcd_brightness", "Jasnosc LCD", base + "/lcd_brightness/state", base + "/lcd_brightness/set", 0.0f, 100.0f, 1.0f, "%");
  publishSwitchDiscovery("relay_force_on", "Przekaznik wymus ON", base + "/relay_override/state", base + "/relay_override/set", "ON", "AUTO", "force_on", "auto");
  publishSwitchDiscovery("relay_force_off", "Przekaznik wymus OFF", base + "/relay_override/state", base + "/relay_override/set", "OFF", "AUTO", "force_off", "auto");
 // publishButtonDiscovery("reset_wifi", "Skasuj WiFi", base + "/reset_wifi/set", "ON"); // możliwość skasowania ustawień wifi z poziomu HA 
  //publishButtonDiscovery("republish_discovery", "Ponow discovery HA", base + "/ha_discovery/set", "ON"); // to nie potrzebne z poziomu HA skoro już go znalazło 
}


void publishMqttState() {
  if (!mqtt.connected()) return;
  String base = mqttBase();

  mqttPublish(base + "/availability", "online", true);

  if (state.sensorOk && !isnan(state.temperature)) mqttPublish(base + "/temperature/state", String(state.temperature, 2), true);
  if (state.sensorOk && !isnan(state.humidity)) mqttPublish(base + "/humidity/state", String(state.humidity, 2), true);
  mqttPublish(base + "/setpoint/state", String(state.target, 2), true);
  mqttPublish(base + "/hysteresis/state", String(config.manualHysteresis, 2), true);
  mqttPublish(base + "/mode/state", modeToHaClimateText(state.mode), true);
  mqttPublish(base + "/action/state", climateActionText(), true);
  mqttPublish(base + "/relay/state", state.relayOn ? "ON" : "OFF", true);
  mqttPublish(base + "/relay_override/state", overrideToText(state.relayOverride), true);
  mqttPublish(base + "/lcd_brightness/state", String(config.lcdBrightness), true);
  mqttPublish(base + "/cycles_today/state", String(state.heatingCyclesToday), true);
  mqttPublish(base + "/wifi_rssi/state", String(state.wifiOk ? WiFi.RSSI() : 0), true);
  mqttPublish(base + "/json/state", stateJson(), true);
}

void mqttCallback(char *topic, byte *payload, unsigned int length) {
  String t(topic);
  String msg;
  msg.reserve(length + 1);
  for (unsigned int i = 0; i < length; i++) msg += (char)payload[i];
  msg.trim();

  String base = mqttBase();
  Serial.print(F("MQTT cmd "));
  Serial.print(t);
  Serial.print(F(" = "));
  Serial.println(msg);

  if (t == String(HA_DISCOVERY_PREFIX) + "/status") {
    msg.toLowerCase();
    if (msg == "online") {
      // Home Assistant explicitly recommends devices republish discovery when HA sends its birth message.
      publishDiscovery();
      publishMqttState();
    }
    return;
  }

  if (t == base + "/setpoint/set") {
    state.manualSetpoint = clampFloat(msg.toFloat(), MIN_SETPOINT, MAX_SETPOINT);
    prefs.putFloat("lastSet", state.manualSetpoint);
    state.mode = MODE_MANUAL;
    state.relayOverride = OVR_NONE;
  } else if (t == base + "/mode/set") {
    msg.toLowerCase();
    if (msg == "auto") state.mode = MODE_AUTO;
    else if (msg == "heat" || msg == "manual") state.mode = MODE_MANUAL;
    else if (msg == "off") state.mode = MODE_OFF;
    state.relayOverride = OVR_NONE;
  } else if (t == base + "/relay_override/set") {
    msg.toUpperCase();
    if (msg == "ON" || msg == "FORCE_ON") state.relayOverride = OVR_FORCE_ON;
    else if (msg == "OFF" || msg == "FORCE_OFF") state.relayOverride = OVR_FORCE_OFF;
    else state.relayOverride = OVR_NONE;
  } else if (t == base + "/hysteresis/set") {
    config.manualHysteresis = clampFloat(msg.toFloat(), 0.1f, 5.0f);
    prefs.putFloat("manHyst", config.manualHysteresis);
  } else if (t == base + "/lcd_brightness/set") {
    setBacklight(clampBrightness(msg.toInt()));
    prefs.putUChar("bright", config.lcdBrightness);
  } else if (t == base + "/schedule/set") {
    saveScheduleRaw(msg);
    parseScheduleText(scheduleRaw);
  } else if (t == base + "/rtc/set") {
    DateTime dt;
    if (state.rtcOk && parseDateTimeString(msg, dt)) rtc.adjust(dt);
  } else if (t == base + "/reset_wifi/set") {
    if (msg == "1" || msg == "ON" || msg == "on") {
      clearWifiCredentials();
      saveConfig();
      wifiReconnectRequested = true;
    }
  } else if (t == base + "/ha_discovery/set") {
    if (msg == "1" || msg == "ON" || msg == "on") {
      publishDiscovery();
      publishMqttState();
    }
  }

  lastMqttPublishMs = 0;
}

void initMqtt() {
  mqtt.setBufferSize(8192);
  mqtt.setKeepAlive(MQTT_KEEPALIVE_SEC);
  mqtt.setSocketTimeout(MQTT_SOCKET_TIMEOUT_SEC);
  wifiClient.setTimeout(MQTT_SOCKET_TIMEOUT_SEC * 1000UL);
  mqtt.setCallback(mqttCallback);

  config.mqttHost.trim();
  config.mqttUser.trim();
  config.mqttPrefix.trim();
  if (config.mqttPrefix.length() == 0) config.mqttPrefix = "home/thermostat";
  if (config.mqttPort == 0) config.mqttPort = 1883;

  Serial.print(F("MQTT config: host="));
  Serial.print(config.mqttHost.length() ? config.mqttHost : String(F("<empty>")));
  Serial.print(F(" port="));
  Serial.print(config.mqttPort);
  Serial.print(F(" user="));
  Serial.print(config.mqttUser.length() ? String(F("set")) : String(F("none")));
  Serial.print(F(" prefix="));
  Serial.println(config.mqttPrefix);
}

void subscribeMqttCommands() {
  String base = mqttBase();
  mqtt.subscribe((base + "/setpoint/set").c_str());
  mqtt.subscribe((base + "/mode/set").c_str());
  mqtt.subscribe((base + "/relay_override/set").c_str());
  mqtt.subscribe((base + "/hysteresis/set").c_str());
  mqtt.subscribe((base + "/lcd_brightness/set").c_str());
  mqtt.subscribe((base + "/schedule/set").c_str());
  mqtt.subscribe((base + "/rtc/set").c_str());
  mqtt.subscribe((base + "/reset_wifi/set").c_str());
  mqtt.subscribe((base + "/ha_discovery/set").c_str());
  mqtt.subscribe((String(HA_DISCOVERY_PREFIX) + "/status").c_str());
}


void connectMqttIfNeeded() {
  if (!state.wifiOk) {
    if (state.mqttOk) mqtt.disconnect();
    state.mqttOk = false;
    mqttLastError = "WiFi offline";
    return;
  }

  config.mqttHost.trim();
  if (config.mqttHost.length() == 0) {
    state.mqttOk = false;
    mqttLastError = "brak MQTT host/IP w konfiguracji";
    return;
  }

