subribe/CELSYNIQ/ESP32S3_Termostat.ino
  if (mqtt.connected()) {
    state.mqttOk = true;
    return;
  }

  state.mqttOk = false;
  if (millis() - lastMqttReconnectMs < MQTT_RECONNECT_INTERVAL_MS) return;
  lastMqttReconnectMs = millis();
  mqttLastAttemptMs = millis();

  IPAddress brokerIp;
  if (!resolveMqttHost(brokerIp)) return;

  mqtt.setServer(brokerIp, config.mqttPort);
  String clientId = sanitizeTopicPart(config.deviceName) + "_" + macSuffix();
  String base = mqttBase();
  String willTopic = base + "/availability";

  Serial.print(F("MQTT connect -> host=")); Serial.print(config.mqttHost);
  Serial.print(F(" ip=")); Serial.print(brokerIp);
  Serial.print(F(" port=")); Serial.print(config.mqttPort);
  Serial.print(F(" clientId=")); Serial.print(clientId);
  Serial.print(F(" user=")); Serial.print(config.mqttUser.length() ? F("set") : F("none"));
  Serial.print(F(" wifiIP=")); Serial.println(WiFi.localIP());

  bool ok = false;
  if (config.mqttUser.length()) {
    ok = mqtt.connect(clientId.c_str(), config.mqttUser.c_str(), config.mqttPass.c_str(),
                      willTopic.c_str(), 1, true, "offline");
  } else {
    ok = mqtt.connect(clientId.c_str(), willTopic.c_str(), 1, true, "offline");
  }

  if (ok) {
    state.mqttOk = true;
    mqttLastError = "connected";
    mqttPublish(willTopic, "online", true);
    subscribeMqttCommands();
    publishDiscovery();
    publishMqttState();
    Serial.println(F("MQTT connected and HA discovery/state published."));
  } else {
    int rc = mqtt.state();
    state.mqttOk = false;
    mqttSetError(String(F("polaczenie nieudane: ")) + mqttStateName(rc));
  }
}

// ------------------------------ INPUT -----------------------------------
void IRAM_ATTR encoderISR() {
  uint8_t a = gpio_get_level((gpio_num_t)PIN_ENC_CLK) ? 1 : 0;
  uint8_t b = gpio_get_level((gpio_num_t)PIN_ENC_DT) ? 1 : 0;
  uint8_t current = (a << 1) | b;
  uint8_t idx = (encLastState << 2) | current;
  int8_t movement = ENC_TABLE[idx & 0x0F];
  encLastState = current;

  if (movement != 0) {
    portENTER_CRITICAL_ISR(&encMux);
    encAcc += movement;
    //if (encAcc >= 4) {  // Enkoder co 4 impulsy 
    if (encAcc >= 2) {   // enkoder co 2 impulsy ( tańszy)
      encDelta++;
      encAcc = 0;
    //} else if (encAcc <= -4) { // w drugą stronę 
    } else if (encAcc <= -2) {
      encDelta--;
      encAcc = 0;
    }
    portEXIT_CRITICAL_ISR(&encMux);
  }
}

int32_t takeEncoderDelta() {
  portENTER_CRITICAL(&encMux);
  int32_t d = encDelta;
  encDelta = 0;
  portEXIT_CRITICAL(&encMux);
  return d;
}

void handleEncoderMove(int32_t delta) {
  if (delta == 0) return;

  if (state.screen == SCREEN_MAIN) {
    if (state.mode != MODE_MANUAL) {
      state.manualSetpoint = state.target;
      state.mode = MODE_MANUAL;
      state.relayOverride = OVR_NONE;
    }
    state.manualSetpoint += delta * SETPOINT_STEP;
    state.manualSetpoint = clampFloat(state.manualSetpoint, MIN_SETPOINT, MAX_SETPOINT);
    pendingManualSetpointSave = true;
    lastManualSetpointChangeMs = millis();
    lastMqttPublishMs = 0;
  } else {
    state.settingsPage += delta;
    while (state.settingsPage < 0) state.settingsPage += 4;
    while (state.settingsPage > 3) state.settingsPage -= 4;
  }
}

void handleShortClick() {
  if (state.screen == SCREEN_MAIN) {
    state.mode = MODE_AUTO;
    state.relayOverride = OVR_NONE;
    lastMqttPublishMs = 0;
  } else {
    state.screen = SCREEN_MAIN;
  }
}

void handleLongClick() {
  state.screen = SCREEN_SETTINGS;
  state.settingsPage = 0;
}

void updateEncoderButton() {
  int32_t d = takeEncoderDelta();
  if (d != 0) handleEncoderMove(d);

  bool rawPressed = (digitalRead(PIN_ENC_SW) == LOW);
  if (rawPressed != btnLastRaw) {
    btnDebounceMs = millis();
    btnLastRaw = rawPressed;
  }

  if (millis() - btnDebounceMs > 35) {
    if (rawPressed != btnStable) {
      btnStable = rawPressed;
      if (btnStable) {
        btnPressStartMs = millis();
        btnLongHandled = false;
      } else {
        if (!btnLongHandled) handleShortClick();
      }
    }
  }

  if (btnStable && !btnLongHandled && millis() - btnPressStartMs >= BUTTON_LONG_PRESS_MS) {
    btnLongHandled = true;
    handleLongClick();
  }
}

// ------------------------------- TASKS ----------------------------------
void taskUI(void *p) {
  wdtAddCurrentTask();
  uint32_t lastFrame = 0;
  while (true) {
    // Main screen stays responsive for encoder changes. Settings pages are almost static,
    // so they are refreshed more slowly to remove the visible menu shimmer/blink.
    uint32_t frameMs = (state.screen == SCREEN_SETTINGS) ? 180 : UI_FRAME_MS;
    if (millis() - lastFrame >= frameMs) {
      lastFrame = millis();
      renderFrame();
    }
    wdtFeed();
    vTaskDelay(1);
  }
}

void taskLogic(void *p) {
  wdtAddCurrentTask();
  while (true) {
    server.handleClient();
    updateEncoderButton();
    if (pendingManualSetpointSave && millis() - lastManualSetpointChangeMs > 900) {
      pendingManualSetpointSave = false;
      prefs.putFloat("lastSet", state.manualSetpoint);
    }
    handleWifiResetPin();

    if (wifiReconnectRequested) {
      wifiReconnectRequested = false;
      reconnectWiFiNow();
    }

    updateWiFiState();

    if (millis() - lastSensorMs >= SENSOR_INTERVAL_MS) {
      lastSensorMs = millis();
      readSensors();
    }

    if (millis() - lastControlMs >= CONTROL_INTERVAL_MS) {
      lastControlMs = millis();
      updateRelayControl();
    }

    connectMqttIfNeeded();
    if (mqtt.connected()) mqtt.loop();

    if (millis() - lastMqttPublishMs >= MQTT_PUBLISH_INTERVAL_MS) {
      lastMqttPublishMs = millis();
      publishMqttState();
    }

    syncRtcFromNtp(false);
    wdtFeed();
    vTaskDelay(1 / portTICK_PERIOD_MS);
  }
}

// ------------------------------- SETUP/LOOP -----------------------------
void setup() {
  Serial.begin(SERIAL_BAUD);
  delay(200);
  Serial.println();
  Serial.print(F("ESP32-S3 thermostat premium starting, FW ")); Serial.println(FW_VERSION);

  pinMode(PIN_RELAY, OUTPUT);
  state.relayOn = false;
  setRelayPhysical(false);

  pinMode(PIN_WIFI_RESET, INPUT_PULLUP);
  pinMode(PIN_ENC_CLK, INPUT_PULLUP);
  pinMode(PIN_ENC_DT, INPUT_PULLUP);
  pinMode(PIN_ENC_SW, INPUT_PULLUP);
  encLastState = ((digitalRead(PIN_ENC_CLK) ? 1 : 0) << 1) | (digitalRead(PIN_ENC_DT) ? 1 : 0);
  attachInterrupt(digitalPinToInterrupt(PIN_ENC_CLK), encoderISR, CHANGE);
  attachInterrupt(digitalPinToInterrupt(PIN_ENC_DT), encoderISR, CHANGE);

  loadConfig();
  if (digitalRead(PIN_WIFI_RESET) == LOW) {
    Serial.println(F("GPIO7 held low at boot: clearing WiFi credentials."));
    clearWifiCredentials();
    saveConfig();
  }
  parseScheduleText(scheduleRaw);

  initDisplay();
  Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL);
  Wire.setClock(400000);
  initSensors();
  initRtc();

  connectWiFiBlocking();
  initWebServer();
  syncRtcFromNtp(true);
  initMqtt();

  // Device must return to automatic schedule after power loss.
  state.mode = MODE_AUTO;
  state.relayOverride = OVR_NONE;
  calculateTarget();
  readSensors();
  updateRelayControl();

  initWatchdog();

  xTaskCreatePinnedToCore(taskUI, "ui", 8192, NULL, 2, &uiTaskHandle, 0);
  xTaskCreatePinnedToCore(taskLogic, "logic", 12288, NULL, 3, &logicTaskHandle, 1);
}

void loop() {
  // Real work is split into FreeRTOS tasks. Keep loop task idle.
  vTaskDelay(1000 / portTICK_PERIOD_MS);
}
